VPro/src/Catalogs/CounterpartyContracts/CounterpartyContracts.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>CounterpartyContracts</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <owners>Catalog.Counterparties</owners>
  <attributes>
    <name>ContractForm</name>
    <type>
      <types>CatalogRef.ContractForms</types>
    </type>
  </attributes>
  <attributes>
    <name>Amount</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>BusinessActivity</name>
    <type>
      <types>CatalogRef.BusinessActivities</types>
    </type>
  </attributes>
  <attributes>
    <name>CashFlowItem</name>
    <type>
      <types>CatalogRef.CashFlowItems</types>
    </type>
  </attributes>
  <attributes>
    <name>SettlementsCurrency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </attributes>
  <attributes>
    <name>ContractKind</name>
    <type>
      <types>EnumRef.ContractKinds</types>
    </type>
  </attributes>
  <attributes>
    <name>DiscountMarkupKind</name>
    <type>
      <types>CatalogRef.MarkupAndDiscountKinds</types>
    </type>
  </attributes>
  <attributes>
    <name>PriceKind</name>
    <type>
      <types>CatalogRef.PriceKinds</types>
    </type>
  </attributes>
  <attributes>
    <name>CounterpartyPriceKind</name>
    <type>
      <types>CatalogRef.CounterpartyPriceKind</types>
    </type>
  </attributes>
  <attributes>
    <name>ContractDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ServiceContractStartDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ServiceContractEndDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ServiceContractDaysBeforeInvoicing</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ServiceContractMonthsBeforeInvoicing</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ServiceContractBusinessActivity</name>
    <type>
      <types>CatalogRef.BusinessActivities</types>
    </type>
  </attributes>
  <attributes>
    <name>ServiceContractPeriodicity</name>
    <type>
      <types>EnumRef.BillingServiceContractPeriodicity</types>
    </type>
  </attributes>
  <attributes>
    <name>ServiceContractTariffPlan</name>
    <type>
      <types>CatalogRef.ServiceContractsTariffPlans</types>
    </type>
  </attributes>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ContactPerson</name>
    <type>
      <types>CatalogRef.ContactPersons</types>
    </type>
  </attributes>
  <attributes>
    <name>ContractType</name>
    <type>
      <types>CatalogRef.CounterpartyContractTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>CounterpartyBankAccount</name>
    <type>
      <types>CatalogRef.BankAccounts</types>
    </type>
  </attributes>
  <attributes>
    <name>Department</name>
    <type>
      <types>CatalogRef.StructuralUnits</types>
    </type>
  </attributes>
  <attributes>
    <name>Responsible</name>
    <type>
      <types>CatalogRef.Employees</types>
    </type>
  </attributes>
  <attributes>
    <name>Status</name>
    <type>
      <types>EnumRef.CounterpartyContractStatuses</types>
    </type>
  </attributes>
  <attributes>
    <name>ValidityStartDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ValidityEndDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ContractNo</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>SettlementsInStandardUnits</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CustomerPaymentDueDate</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>VendorPaymentDueDate</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>IsServiceContract</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>AdditionalAttributes</name>
    <attributes>
      <name>Property</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AdditionalAttributesAndInformation</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Characteristic.AdditionalAttributesAndInformation</types>
      </type>
    </attributes>
    <attributes>
      <name>TextString</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>EditableParameters</name>
    <attributes>
      <name>FormRefs</name>
      <type>
        <types>CatalogRef.ContractForms</types>
      </type>
    </attributes>
    <attributes>
      <name>Presentation</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>InfobaseParameters</name>
    <attributes>
      <name>FormRefs</name>
      <type>
        <types>CatalogRef.ContractForms</types>
      </type>
    </attributes>
    <attributes>
      <name>Presentation</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Parameter</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AdditionalAttributesAndInformation</types>
        <types>EnumRef.ContractsWithCounterpartiesTemplatesParameters</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ServiceContractMailingRecipients</name>
    <attributes>
      <name>EmailAddress</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Contact</name>
      <type>
        <types>CatalogRef.ContactPersons</types>
        <types>CatalogRef.Counterparties</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

VPro/src/Enums/ContractKinds/ContractKinds.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ContractKinds</name>
  <enumValues>
    <name>WithVendor</name>
  </enumValues>
  <enumValues>
    <name>WithCustomer</name>
  </enumValues>
  <enumValues>
    <name>FromPrincipal</name>
  </enumValues>
  <enumValues>
    <name>WithAgent</name>
  </enumValues>
  <enumValues>
    <name>Other</name>
  </enumValues>
</mdclass:Enum>

VPro/src/Enums/CounterpartyContractStatuses/CounterpartyContractStatuses.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>CounterpartyContractStatuses</name>
  <enumValues>
    <name>NotAgreed</name>
  </enumValues>
  <enumValues>
    <name>Active</name>
  </enumValues>
  <enumValues>
    <name>Closed</name>
  </enumValues>
</mdclass:Enum>

VPro/src/Catalogs/Companies/Companies.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Companies</name>
  <predefined>
    <items>
      <name>MainCompany</name>
      <description>Doanh nghiệp chúng ta</description>
    </items>
  </predefined>
  <attributes>
    <name>BankAccountByDefault</name>
    <type>
      <types>CatalogRef.BankAccounts</types>
    </type>
  </attributes>
  <attributes>
    <name>BusinessCalendar</name>
    <type>
      <types>CatalogRef.Calendars</types>
    </type>
  </attributes>
  <attributes>
    <name>DefaultVATRate</name>
    <type>
      <types>CatalogRef.VATRates</types>
    </type>
  </attributes>
  <attributes>
    <name>DescriptionFull</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>FileFacsimilePrinting</name>
    <type>
      <types>CatalogRef.CompaniesAttachedFiles</types>
    </type>
  </attributes>
  <attributes>
    <name>IncludeVATInPrice</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Individual</name>
    <type>
      <types>CatalogRef.Individuals</types>
    </type>
  </attributes>
  <attributes>
    <name>LegalEntityIndividual</name>
    <type>
      <types>EnumRef.CounterpartyKinds</types>
    </type>
  </attributes>
  <attributes>
    <name>LogoFile</name>
    <type>
      <types>CatalogRef.CompaniesAttachedFiles</types>
    </type>
  </attributes>
  <attributes>
    <name>PettyCashByDefault</name>
    <type>
      <types>CatalogRef.PettyCashes</types>
    </type>
  </attributes>
  <attributes>
    <name>Prefix</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>RegistrationDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>RegistrationNumber</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>RegistrationCountry</name>
    <type>
      <types>CatalogRef.WorldCountries</types>
    </type>
  </attributes>
  <attributes>
    <name>TIN</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>VATNumber</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>LegalForm</name>
    <type>
      <types>CatalogRef.LegalForms</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ContactInformation</name>
    <attributes>
      <name>Type</name>
      <type>
        <types>EnumRef.ContactInformationTypes</types>
      </type>
    </attributes>
    <attributes>
      <name>Kind</name>
      <type>
        <types>CatalogRef.ContactInformationKinds</types>
      </type>
    </attributes>
    <attributes>
      <name>Presentation</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>FieldValues</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Country</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Region</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>City</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>EmailAddress</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ServerDomainName</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PhoneNumber</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PhoneNumberWithoutCodes</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>AdditionalAttributes</name>
    <attributes>
      <name>Property</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AdditionalAttributesAndInformation</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Characteristic.AdditionalAttributesAndInformation</types>
      </type>
    </attributes>
    <attributes>
      <name>TextString</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ActivityTypes</name>
    <attributes>
      <name>ActivityType</name>
      <type>
        <types>CatalogRef.ActivityTypes</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

VPro/src/Catalogs/CounterpartyContracts/ObjectModule.bsl
#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region EventsHandlers

Procedure OnCopy(CopiedObject)
	
	// Billing
	ServiceContractBusinessActivity = Undefined;
	
EndProcedure

Procedure Filling(FillingData, FillingText, StandardProcessing)
	
	If TypeOf(FillingData) = Type("CatalogRef.Counterparties") Then
		
		FillByCounterparty(FillingData);
		
	ElsIf TypeOf(FillingData) = Type("Structure") Then
		
		FillByStructure(FillingData);
		
	EndIf;
	
	FillByDefault();
	
EndProcedure

Procedure FillCheckProcessing(Cancel, CheckedAttributes)
	
	// Prices kind.
	If ValueIsFilled(DiscountMarkupKind) Then
		CheckedAttributes.Add("PriceKind");
	EndIf;
	
	// Billing
	If IsServiceContract Then
		CheckedAttributes.Add("PriceKind");
		CheckedAttributes.Add("ServiceContractStartDate");
		CheckedAttributes.Add("ServiceContractTariffPlan");
		CheckedAttributes.Add("ServiceContractPeriodicity");
	EndIf;
		
EndProcedure

Procedure BeforeWrite(Cancel)
	
	If DataExchange.Load Then
		Return;
	EndIf;
	
	If DeletionMark Then
		
		CounterpartyAttributesValues = CommonUse.ObjectAttributesValues(Owner, "DeletionMark, ContractByDefault");
		
		If Not CounterpartyAttributesValues.DeletionMark And CounterpartyAttributesValues.ContractByDefault = Ref Then
			MessageText = NStr("en='The counterparty contract, established as the main, can not be marked for deletion.';ru='Договор контрагента, установленный в качестве основного, не может быть помечен на удаление.';vi='Không thể đặt dấu xóa hợp đồng đối tác được thiết lập là hợp đồng chính.'");
			CommonUseClientServer.MessageToUser(MessageText, Ref,,, Cancel);
		EndIf;
		
	EndIf;
	
	Query = New Query(
	"SELECT
	|	CounterpartyContracts.Ref
	|FROM
	|	Catalog.CounterpartyContracts AS CounterpartyContracts
	|WHERE
	|	CounterpartyContracts.Ref <> &Ref
	|	AND CounterpartyContracts.Owner = &Owner
	|	AND Not CounterpartyContracts.Owner.DoOperationsByContracts");
	
	Query.SetParameter("Ref", Ref);
	Query.SetParameter("Owner", Owner);
	
	Selection = Query.Execute().Select();
	
	If Selection.Next() Then
		MessageText = NStr("en='Contracts are not accounted for the counterparty.';ru='Для контрагента не ведется учет по договорам.';vi='Đối với đối tác không tiến hành kế toán theo hợp đồng.'");
		SmallBusinessServer.ShowMessageAboutError(
			ThisObject,
			MessageText,
			,
			,
			,
			Cancel
		);
	EndIf;
	
	// Billing
	If IsServiceContract And IsNew()
		Or IsServiceContract And Not IsNew() And Not Ref.IsServiceContract Then
		
		UseBusinessActivities = Constants.BillingKeepExpensesAccountingByServiceContracts.Get();
		If UseBusinessActivities Then
			ServiceContractBusinessActivity = 
				Catalogs.CounterpartyContracts.CreateBusinessActivityForServiceContract(Owner, Description);
		EndIf;
	EndIf;
		
	If ValueIsFilled(Ref) Then
		AdditionalProperties.Insert("DeletionMark", Ref.DeletionMark);
	EndIf;
	
EndProcedure

#EndRegion

#Region FillingProcedures

Procedure FillByCounterparty(FillingData)
	
	AttributesValues	= CommonUse.ObjectAttributesValues(FillingData, "Customer,Supplier,OtherRelationship, BankAccountByDefault");
	
	CompanyByDefault = SmallBusinessReUse.GetValueByDefaultUser(Users.CurrentUser(), "MainCompany");
	If Not ValueIsFilled(CompanyByDefault) Then
		CompanyByDefault = Catalogs.Companies.MainCompany;
	EndIf;
	
	Description				= NStr("en='Main contract';ru='Основной договор';vi='Hợp đồng chính'");
	SettlementsCurrency		= Constants.NationalCurrency.Get();
	Company					= CompanyByDefault;
	ContractKind			= Enums.ContractKinds.WithCustomer;
	CashFlowItem			= Catalogs.CashFlowItems.PaymentFromCustomers;
	If AttributesValues.Supplier And Not AttributesValues.Customer Then
		ContractKind		= Enums.ContractKinds.WithVendor;
		CashFlowItem		= Catalogs.CashFlowItems.PaymentToVendor;
	ElsIf AttributesValues.OtherRelationship And Not AttributesValues.Customer And Not AttributesValues.Supplier Then
		ContractKind		= Enums.ContractKinds.Other;
		CashFlowItem		= Catalogs.CashFlowItems.Other;
	EndIf;
	PriceKind				= Catalogs.PriceKinds.GetMainKindOfSalePrices();
	Owner					= FillingData;
	VendorPaymentDueDate	= Constants.VendorPaymentDueDate.Get();
	CustomerPaymentDueDate	= Constants.CustomerPaymentDueDate.Get(); 
	CounterpartyBankAccount	= AttributesValues.BankAccountByDefault;
	Status					= Enums.CounterpartyContractStatuses.Active;
	
	If Not IsFolder And AdditionalProperties.Property("NewPriceKind") Then
		
		CounterpartyPriceKind = Catalogs.CounterpartyPriceKind.GetRef();
		AdditionalProperties.NewPriceKind = CounterpartyPriceKind;
		
	EndIf;

EndProcedure

Procedure FillByStructure(FillingData)

	If FillingData.Property("Owner") And ValueIsFilled(FillingData.Owner) Then
		
		FillByCounterparty(FillingData.Owner);
		
	EndIf;
	

EndProcedure

#EndRegion

#Region ServiceProceduresAndFunctions

Procedure FillByDefault()
	
	If IsFolder Then
		Return;
	EndIf;
	
	If Not ValueIsFilled(Responsible) Then
		Responsible = SmallBusinessReUse.GetValueByDefaultUser(Users.CurrentUser(), "MainResponsible");
	EndIf;
	
	If Not ValueIsFilled(Department) Then
		Department = SmallBusinessReUse.GetValueByDefaultUser(Users.CurrentUser(), "MainDepartment");
		If Not ValueIsFilled(Department) Then
			Department	= Catalogs.StructuralUnits.MainDepartment;	
		EndIf;
	EndIf;
	
	If Not ValueIsFilled(BusinessActivity) Then
		BusinessActivity	= Catalogs.BusinessActivities.MainActivity;	
	EndIf;
	
EndProcedure

Procedure OnWrite(Cancel)
	
	// Billing
	If IsServiceContract Then
		If ValueIsFilled(ServiceContractBusinessActivity) Then
			// Если договор помечается (снимается пометка) на удаление, так же помечаем и связанное с ним направление деятельности.
			If AdditionalProperties.Property("DeletionMark") Then
				If AdditionalProperties.DeletionMark = False And DeletionMark = True
					Or AdditionalProperties.DeletionMark = True And DeletionMark = False Then
					
					BusinessActivityObject = ServiceContractBusinessActivity.GetObject();
					BusinessActivityObject.DeletionMark = DeletionMark;
					BusinessActivityObject.Write();
				EndIf;
			EndIf;
		EndIf;
	EndIf;
		
	If Not IsFolder And AdditionalProperties.Property("NewPriceKind") Then
		
		PriceKindObject = Catalogs.CounterpartyPriceKind.CreateItem();
		PriceKindObject.Fill(Ref);
		PriceKindObject.SetNewObjectRef(AdditionalProperties.NewPriceKind);
		
		PriceKindObject.Write();
		
	EndIf;
	
EndProcedure

#EndRegion

#EndIf
